#            _
#    _______| |__   ___ _ ____   __
#   |_  / __| '_ \ / _ \ '_ \ \ / /
#  _ / /\__ \ | | |  __/ | | \ V /
# (_)___|___/_| |_|\___|_| |_|\_/
#


# ========================================
# 環境設定
# ========================================
# 言語を日本語にする
export LANG=ja_JP.UTF-8

# エディタをvimにする
export EDITOR=vim

# xtermを256色表示可能にする
if [ "$TERM"="xterm" ]
then
  export TERM="xterm-256color"
fi


# ========================================
# rbenv設定
# ========================================
export PATH="$HOME/.rbenv/bin:$PATH"
eval "$(rbenv init -)"


# ========================================
# screen設定
# ========================================
if [ "$TERM"="screen-bce" ]
then
  export SHELL_NAME="$(basename $SHELL)"
fi

